Repository: 84000/data-translation-memory
Catalog: toh317_84000-distinctly-ascertaining-the-meanings.tmx
Source language: bo
Languages: en

source: ཉིན་མོའི་འདུ་ཤེས་ལ་ཤིན་ཏུ་གནས་ནས་དེ་སྣང་བ་དེ་སེམས་ལ་སྒོམ་སྟེ།
en: He cultivates a mind sustained by the perception of daylight, with the same brightness:

source: ཉིན་མོ་ཇི་ལྟ་བར་མཚན་མོ་ཡང་དེ་བཞིན།
en: as by day, so by night;

source: མཚན་མོ་ཇི་ལྟ་བར་ཉིན་མོ་ཡང་དེ་བཞིན།
en: as by night, so by day;

source: སྔར་ཇི་ལྟ་བར་ཕྱིས་ཀྱང་དེ་བཞིན།
en: as in front, so behind;

source: ཕྱིས་ཇི་ལྟ་བར་སྔར་ཡང་དེ་བཞིན།
en: as behind, so in front;

source: འོག་ཏུ་ཇི་ལྟ་བར་སྟེང་དུ་ཡང་དེ་བཞིན།
en: as below, so above;

source: སྟེང་དུ་ཇི་ལྟ་བར་འོག་ཏུ་ཡང་དེ་བཞིན་ཏེ།
en: as above, so below.

source: དེ་ལྟར་ཕྱེ་ཞིང་ཀུན་ནས་བསྐོར་བ་མེད་པའི་སེམས་ཀྱིས་ཉིན་མོའི་འདུ་ཤེས་ལ་ཤིན་ཏུ་གནས་ཏེ། དེ་སྣང་བ་དེ་སེམས་ལ་སྒོམ་མོ། །དགེ་སློང་དག་འདི་ལྟ་སྟེ། དཔེར་ན་སོས་ཀའི་ཟླ་བ་ཐ་མ་ལ་ནམ་མཁའ་ལ་སྤྲིན་མེད་ཅིང་སྤྲིན་དང་བྲལ་བའི་ཉིན་མོ་ཉི་མའི་གུང་ལ་སྣང་བ་ཡོངས་སུ་དག་ཅིང་ཡོངས་སུ་དཀར་ལ་འོད་གསལ་ཏེ་མུན་པ་མ་ཡིན་ནོ། །དགེ་སློང་དག་དེ་བཞིན་དུ་དགེ་སློང་གིས་སྣང་བའི་འདུ་ཤེས་ཤིན་ཏུ་ལེགས་པར་བཟུང་།
en: Thus, with an open and unbound mind, he cultivates a mind sustained by the perception of daylight, with the same brightness. Just as, indeed, bhikṣus, during the last month of summer, at midday on a cloudless day free of any impediment to light, everything appears very clearly, bright and luminous, and untouched by darkness, in the very same way, bhikṣus, a bhikṣu has well and properly grasped the perception of light;

source: མཚན་མོ་ཇི་ལྟ་བར་ཉིན་མོ་འང་དེ་བཞིན།
en: as by night, so by day;

source: འོག་ཇི་ལྟ་བར་སྟེང་ཡང་དེ་བཞིན།
en: as below, so above;

source: དེ་ལྟར་ཕྱེ་ཞིང་ཀུན་ནས་བསྐོར་བ་མེད་པའི་སེམས་ཀྱིས་ཉིན་མོའི་འདུ་ཤེས་ཤིན་ཏུ་གནས་ནས་དེ་སྣང་བ་དེ་སེམས་ལ་སྒོམ་པ་སྟེ།
en: Thus, with an open and unbound mind sustained by the perception of daylight, he cultivates a mind with the same brightness.

source: འདི་ནི་ཏིང་ངེ་འཛིན་བསྒོམ་པ་ཀུན་ཏུ་བསྟེན་ཏེ་བསྒོམས་ཤིང་མང་དུ་བྱས་ན་ཡེ་ཤེས་མཐོང་བ་འཐོབ་པར་འགྱུར་རོ།
en: This is the cultivation of samādhi that, once it is practiced, cultivated, and repeated, brings about the obtainment of the vision of awareness.

source: །དགེ་སློང་དག་དེ་ལ་ཏིང་ངེ་འཛིན་བསྒོམ་པ་ཀུན་ཏུ་བསྟེན་ཏེ་བསྒོམས་ཤིང་མང་དུ་བྱས་ན་ཤེས་རབ་འཐོབ་པར་འགྱུར་བ་གང་ཞེ་ན།
en: “Among those, bhikṣus, what is the cultivation of samādhi that, once it is practiced, cultivated, and repeated, brings about the obtainment of wisdom?

source: དགེ་སློང་དག་འདི་ལ་དགེ་སློང་དགོན་པ་ན་འདུག་ཀྱང་རུང་། ཤིང་དྲུང་ན་འདུག་ཀྱང་རུང་། ཁང་སྟོང་ན་འདུག་ཀྱང་རུང་སྟེ། བདེ་བ་ཡང་སྤངས་ཏེ། སྔ་ནས་སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་། ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་སྡུག་བསྔལ་ཡང་མེད། བདེ་བ་ཡང་མེད་དེ། བཏང་སྙོམས་དང་། དྲན་པས་ཡོངས་སུ་དག་པ་བསམ་གཏན་བཞི་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས་གནས་ཏེ།
en: Here, bhikṣus, a bhikṣu, having gone to the forest, to the root of some tree, or to an empty house, may—due to the abandonment of pleasure, the prior abandonment of pain, and the disappearance of mental well-being or anguish—reach and abide in the fourth meditation, which is without pain or pleasure and is purified in terms of equanimity and mindfulness.

source: འདི་ནི་ཏིང་ངེ་འཛིན་བསྒོམ་པ་ཀུན་ཏུ་བསྟེན་ཏེ་བསྒོམས་ཤིང་མང་དུ་བྱས་ན་ཤེས་རབ་འཐོབ་པར་འགྱུར་བ་སྟེ།
en: This is the cultivation of samādhi that, once it is practiced, cultivated, and repeated, brings about the obtainment of wisdom.

source: དགེ་སློང་དག་འདི་དག་ནི་ཏིང་ངེ་འཛིན་བསྒོམ་པ་བཞི་པའོ། །དགེ་སློང་དག་དེ་ལ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་གང་ཞེ་ན།
en: “These are the four cultivations of samādhi. “Now, bhikṣus, what are the four placements of mindfulness?

source: དགེ་སློང་དག་འདི་ལ་དགེ་སློང་རྟུན་པ་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པས་འཇིག་རྟེན་གྱི་བརྣབ་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ནས་ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་དང་། རྟུན་པ་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པས་འཇིག་རྟེན་གྱི་བརྣབ་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ནས་ནང་གི་ལུས་དང་། ཕྱིའི་ལུས་དང་། ནང་དང་ཕྱིའི་ལུས་དང་། ནང་གི་ཚོར་བ་རྣམས་དང་། ཕྱིའི་ཚོར་བ་རྣམས་དང་། ནང་དང་ཕྱིའི་ཚོར་བ་རྣམས་དང་། ནང་གི་སེམས་དང་། ཕྱིའི་སེམས་དང་། ནང་དང་ཕྱིའི་སེམས་དང་། ནང་གི་ཆོས་རྣམས་དང་། ཕྱིའི་ཆོས་རྣམས་དང་། ནང་དང་ཕྱིའི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་སྟེ།
en: Here, bhikṣus, with respect to his own body, a bhikṣu abides contemplating the body—ardent, perfectly cognizant, mindful, and having removed coveting or mental anguish regarding the world. With respect to an outer body, with respect to his own and an outer body, with respect to his own feelings, with respect to outer feelings, with respect to his own and outer feelings, with respect to his own mind, with respect to any outer mind, with respect to his own and an outer mind, with respect to dharmas belonging to himself, with respect to outer dharmas, and with respect to dharmas belonging to himself as well as outer dharmas, he abides contemplating dharmas.

source: དགེ་སློང་དག་འདི་དག་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་བཞིའོ།
en: These, bhikṣus, are the four placements of mindfulness.

source: །དགེ་སློང་དག་དེ་ལ་ཡང་དག་པར་སྤོང་བ་བཞི་གང་ཞེ་ན།
en: “Now, bhikṣus, what are the four right efforts?

source: དགེ་སློང་དག་དེ་ལ་དགེ་སློང་སྡིག་པ་མི་དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་སྤང་བའི་ཕྱིར། འདུན་པ་སྐྱེད་ཅིང་འབད་དེ་བརྩོན་འགྲུས་རྩོམ་ལ་སེམས་རབ་ཏུ་འཛིན་ཅིང་ཡང་།
en: Here, bhikṣus, a bhikṣu generates zeal, strives, brings forth heroism, takes hold of his mind, and properly sets it so as to abandon sinful, nonvirtuous dharmas that have already arisen.

source: མ་དག་པར་རབ་ཏུ་འཇོག་པ་དང་། སྡིག་པ་མི་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་མི་བསྐྱེད་པའི་ཕྱིར།
en: He generates zeal, strives, brings forth heroism, takes hold of his mind, and properly sets it toward the nonarising of sinful, nonvirtuous dharmas that have yet to arise.

source: དྲན་པ་སྐྱེད་ཅིང་འབད་དེ་བརྩོན་འགྲུས་རྩོམ་ལ་སེམས་རབ་ཏུ་འཛིན་ཅིང་ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་དང་། དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་བསྐྱེད་པའི་ཕྱིར།
en: He generates zeal, strives, brings forth heroism, takes hold of his mind, and properly sets it toward the arising of virtuous dharmas that have yet to arise.

source: འདུན་པ་སྐྱེད་ཅིང་འབད་དེ་བརྩོན་འགྲུས་རྩོམ་ལ་སེམས་རབ་ཏུ་འཛིན་ཅིང་ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་དང་། དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་གནས་པ་དང་། མི་བརྗེད་པ་དང་། ཉམས་པར་མི་འགྱུར་བ་དང་། ཕྱིར་ཞིང་འབྱུང་བ་དང་། རྒྱས་པ་དང་། ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར། འདུན་པ་སྐྱེད་ཅིང་འབད་དེ་བརྩོན་འགྲུས་རྩོམ་ལ་སེམས་རབ་ཏུ་འཛིན་ཅིང་ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་སྟེ།
en: He generates zeal, strives, brings forth heroism, takes hold of his mind, and properly sets it toward the abiding, non-loss, non-destruction, recurrence, greatness, and fulfillment of virtuous dharmas that have already arisen.

source: དགེ་སློང་དག་འདི་དག་ནི་ཡང་དག་པར་སྤོང་བ་བཞིའོ།
en: These, bhikṣus, are the four right efforts.

source: །དགེ་སློང་དག་དེ་ལ་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་གང་ཞེ་ན། འདི་ལ་དགེ་སློང་བདག་གི་འདུན་པ་ཧ་ཅང་བྱིང་ན་ཡང་མི་རུང་།
en: “Now, bhikṣus, what are the four footings of success? Here, bhikṣus, a bhikṣu, endowed with the zeal samādhi and with the factors of abandonment, cultivates the footing of success based on isolation, based on nonattraction, based on cessation, and matured by relinquishment.

source: ཧ་ཅང་བཟུང་ན་ཡང་མི་རུང་ངོ་།
en: His own zeal is neither too absorbed nor too tightly grasped.

source: །ཞེས་འདུན་པའི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་སྒོམ་པ་དང་། བདག་གི་བརྩོན་འགྲུས་ཧ་ཅང་བྱིང་ན་ཡང་མི་རུང་།
en: Endowed with the heroism samādhi and with the factors of abandonment, he cultivates the footing of success based on isolation, based on nonattraction, based on cessation, and matured by relinquishment.

source: །ཞེས་བརྩོན་འགྲུས་ཀྱི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ།
en: Endowed with the mind samādhi and with the factors of abandonment, he cultivates the footing of success based on isolation, based on nonattraction, based on cessation, and matured by relinquishment.

source: རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་སྒོམ་པ་དང་། བདག་གི་སེམས་ཧ་ཅང་བྱིང་ན་ཡང་མི་རུང་། ཧ་ཅང་བཟུང་ན་ཡང་མི་རུང་ངོ་།
en: His own mind is neither too absorbed nor too tightly grasped.

source: །ཞེས་སེམས་ཀྱི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ།
en: Endowed with the investigation samādhi and with the factors of abandonment, he cultivates the footing of success based on isolation, based on nonattraction, based on cessation, and matured by relinquishment.

source: རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་སྒོམ་པ་དང་། བདག་གི་དཔྱོད་པ་ནི་ཧ་ཅང་བྱིང་ན་ཡང་མི་རུང་། ཧ་ཅང་བཟུང་ན་ཡང་མི་རུང་ངོ་། །ཞེས་དཔྱོད་པའི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ། དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་སྒོམ་པ་སྟེ།
en: His own investigation is neither too absorbed nor too tightly grasped.

source: དགེ་སློང་དག་འདི་དག་ནི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞིའོ།
en: These, bhikṣus, are the four footings of success.

source: །དགེ་སློང་དག་དེ་ལ་དབང་པོ་ལྔ་གང་ཞེ་ན།
en: “Now, bhikṣus, what are the five faculties?

source: །དེ་ལ་དད་པའི་དབང་པོ་གང་ཞེ་ན།
en: “Among these, what is the faith faculty?

source: དད་པ་གང་གིས་ཆོས་བཞི་ལ་དད་པ་སྟེ།
en: It is that faith thanks to which one has faith in four dharmas.

source: འཁོར་བ་ན་སྤྱོད་པ་འཇིག་རྟེན་པའི་ཡང་དག་པའི་ལྟ་བ་ལ་དད་པ་དང་། དེ་ལ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་རྟོན་པ་དང་། ལས་དགེ་བ་ཡང་རུང་།
en: One has faith in the worldly right view that applies to saṃsāra. One goes for refuge in the maturation of karma.

source: མི་དགེ་བ་ཡང་རུང་། གང་བྱེད་པའི་ལས་དེ་དང་དེའི་རྣམ་པར་སྨིན་པ་མྱོང་བར་འགྱུར་བ་དང་། དེ་སྲོག་གི་ཕྱིར་ཡང་སྡིག་པའི་ལས་མངོན་པར་འདུ་མི་བྱེད་པ་སྟེ།
en: One thinks, ‘Whatever karma I perform, whether virtuous or nonvirtuous, I will experience the maturation of that karma only.’ Even for the sake of one’s own life, one does not perform sinful karma.

source: འདི་ནི་དད་པའི་དབང་པོ་ཞེས་བྱའོ།
en: This is explained as the faith faculty.

source: །དེ་ལ་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་གང་ཞེ་ན།
en: “Among these, what is the heroism faculty?

source: དད་པའི་དབང་པོས་ཆོས་གང་དག་ལ་དད་པའི་ཆོས་དེ་དག་བརྩོན་འགྲུས་ཀྱི་དབང་པོས་ཡང་དག་པར་སྒྲུབ་པ་སྟེ།
en: Through the heroism faculty, one establishes those dharmas that one has faith in thanks to the faith faculty.

source: འདི་ནི་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཞེས་བྱའོ།
en: This is explained as the heroism faculty.

source: །དེ་ལ་དྲན་པའི་དབང་པོ་གང་ཞེ་ན།
en: “Among these, what is the mindfulness faculty?

source: ཆོས་གང་དག་བརྩོན་འགྲུས་ཀྱི་དབང་པོས་ཡང་དག་པར་སྒྲུབ་པའི་ཆོས་དེ་དག་དྲན་པའི་དབང་པོས་ཆུད་མི་གཟོན་པ་སྟེ།
en: Thanks to the mindfulness faculty, one does not cause the disappearance of those dharmas that one establishes through the heroism faculty.

source: འདི་དག་ནི་དྲན་པའི་དབང་པོ་ཞེས་བྱའོ།
en: This is explained as the mindfulness faculty.

source: །དེ་ལ་ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་གང་ཞེ་ན།
en: “Among these, what is the samādhi faculty?

source: ཆོས་གང་དག་དྲན་པའི་དབང་པོས་ཆུད་མི་གཟོན་པའི་ཆོས་དེ་དག་ལ་ཏིང་ངེ་འཛིན་གྱི་དབང་པོས་རྩེ་གཅིག་ཏུ་བྱེད་པ་སྟེ།
en: Through the samādhi faculty, one makes one-pointed those dharmas that one does not cause to disappear thanks to the mindfulness faculty.

source: འདི་ནི་ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་ཞེས་བྱའོ།
en: This is explained as the samādhi faculty.

source: །དེ་ལ་ཤེས་རབ་ཀྱི་དབང་པོ་གང་ཞེ་ན།
en: “Among these, what is the wisdom faculty?

source: ཆོས་གང་དག་ལ་ཏིང་ངེ་འཛིན་གྱི་དབང་པོས་རྩེ་གཅིག་ཏུ་བྱེད་པའི་ཆོས་དེ་དག་ཤེས་རབ་ཀྱི་དབང་པོས་རབ་ཏུ་རྟོག་ཅིང་།
en: Through the wisdom faculty, one penetrates those dharmas that one makes one-pointed through the samādhi faculty;

source: དེ་ཆོས་དེ་དག་ལ་སོ་སོར་རྟོག་པའི་རང་བཞིན་ཅན་ཡིན་ཏེ།
en: one becomes the type that carefully observes those dharmas.

source: འདི་ནི་ཤེས་རབ་ཀྱི་དབང་པོ་ཞེས་བྱ་སྟེ།
en: This is explained as the wisdom faculty.

source: དགེ་སློང་དག་འདི་དག་ནི་དབང་པོ་ལྔའོ།
en: “These, bhikṣus, are the five faculties.

source: །དགེ་སློང་དག་དེ་ལ་སྟོབས་ལྔ་གང་ཞེ་ན།
en: “Now, bhikṣus, what are the five strengths?

source: འདི་ལྟ་སྟེ། དད་པའི་སྟོབས་དང་། བརྩོན་འགྲུས་ཀྱི་སྟོབས་དང་། དྲན་པའི་སྟོབས་དང་། ཏིང་ངེ་འཛིན་གྱི་སྟོབས་དང་། ཤེས་རབ་ཀྱི་སྟོབས་ཏེ།
en: They are the strength of faith, the strength of heroism, the strength of mindfulness, the strength of samādhi, and the strength of wisdom.

source: དགེ་སློང་དག་འདི་དག་ནི་སྟོབས་ལྔའོ།
en: These, bhikṣus, are the five strengths.

source: །དགེ་སློང་དག་དེ་ལ་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་གང་ཞེ་ན།
en: “Now, bhikṣus, what are the seven parts of awakening?

source: དགེ་སློང་དག་འདི་ལ་དགེ་སློང་དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ།
en: They are the part of awakening of mindfulness, the part of awakening of classifying the dharmas, the part of awakening of heroism, the part of awakening of joy, the part of awakening of ease, the part of awakening of samādhi, and the part of awakening of equanimity. Here, bhikṣus, a bhikṣu cultivates the part of awakening of mindfulness:

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་སྒོམ་པ་དང་། དེ་བཞིན་དུ།
en: this is based on isolation, based on nonattraction, based on cessation, and matured by relinquishment.

source: ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ།
en: In the same way, he cultivates the part of awakening of classifying the dharmas:

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ།
en: this is based on isolation, based on nonattraction, based on cessation, and matured by relinquishment.

source: རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་སྒོམ་པ་དང་། བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ།
en: He cultivates the part of awakening of heroism:

source: རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་སྒོམ་པ་དང་། དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ།
en: He cultivates the part of awakening of joy:

source: རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་སྒོམ་པ་དང་། ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ།
en: He cultivates the part of awakening of ease:

source: རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་སྒོམ་པ་དང་། ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ།
en: He cultivates the part of awakening of samādhi:

source: རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་སྒོམ་པ་དང་། བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ།
en: He cultivates the part of awakening of equanimity:

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་སྒོམ་པ་སྟེ།
en: this is based on isolation, based on nonattraction, based on cessation, and matured by relinquishment.

source: དགེ་སློང་དག་འདི་དག་ནི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ནོ།
en: These, bhikṣus, are the seven parts of awakening.

source: །དགེ་སློང་དག་དེ་ལ་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་གང་ཞེ་ན།
en: “Now, bhikṣus, what is the noble path with eight parts?

source: འདི་ལྟ་སྟེ། ཡང་དག་པའི་ལྟ་བ་དང་། ཡང་དག་པའི་རྟོག་པ་དང་། ཡང་དག་པའི་ངག་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་། ཡང་དག་པའི་འཚོ་བ་དང་། ཡང་དག་པའི་རྩོལ་བ་དང་། ཡང་དག་པའི་དྲན་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཏེ།
en: It is right view, right thinking, right speech, right activity, right livelihood, right effort, right mindfulness, and right samādhi.

source: དགེ་སློང་དག་འདི་ནི་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའོ།
en: This, bhikṣus, is the noble path with eight parts.

source: །དེ་ལ་ཡང་དག་པའི་ལྟ་བ་གང་ཞེ་ན།
en: “Among these, what is right view?

source: གང་འཇིག་རྟེན་ལས་འདས་པ་བདག་མེད་པའི་ལྟ་བ་ལས་བྱུང་བ་ཡིན་གྱི། སེམས་ཅན་ལས་མ་ཡིན།
en: It is supramundane; arisen from the view of no-self;

source: སྲོག་ལས་མ་ཡིན། གསོ་བ་ལས་མ་ཡིན། སྐྱེས་བུ་ལས་མ་ཡིན། གང་ཟག་ལས་མ་ཡིན། ཤེད་ལས་སྐྱེས་ལས་མ་ཡིན།
en: not arisen from the view of a sentient being, of a living being, of a nourishing being, of a man, of a person, of a descendant of Manu, or of a human being;

source: ཤེས་བུར་ལྟ་བ་ལས་བྱུང་བ་མ་ཡིན། ཆད་པ་དང་། རྟག་པར་ལྟ་བ་ལས་བྱུང་བ་མ་ཡིན།
en: not arisen from the view of cutting off or eternality;

source: འབྱུང་བ་དང་། འཇིག་པར་ལྟ་བ་ལས་བྱུང་བ་མ་ཡིན།
en: not arisen from the view of existence or nonexistence;

source: དགེ་བ་དང་། མི་དགེ་བ་དང་། ལུང་དུ་མ་བསྟན་པར་ལྟ་བ་ལས་བྱུང་བ་མ་ཡིན་པ་ནས་འཁོར་བ་དང་། མྱ་ངན་ལས་འདས་པའི་བར་ལ་ལྟ་བ་ལས་བྱུང་བ་མ་ཡིན་པ་སྟེ།
en: not arisen from the view of the virtuous, nonvirtuous, or undetermined; and not arisen from the view of saṃsāra or nirvāṇa.

source: འདི་ནི་ཡང་དག་པའི་ལྟ་བ་ཞེས་བྱའོ།
en: This is called right view

source: །དེ་ལ་ཡང་དག་པའི་རྟོག་པ་གང་ཞེ་ན།
en: “Among these, what is right thought?

source: རྟོག་པ་གང་དག་གིས་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་ཉོན་མོངས་པ་རྣམས་འབྱུང་བར་འགྱུར་བའི་རྟོག་པ་དེ་དག་ལ་མི་རྟོག་གི།
en: One does not think those thoughts due to which the afflictions of desire, aversion, and confusion rise up.

source: རྟོག་པ་གང་གིས་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་རྣམས་འབྱུང་བར་འགྱུར་བ་དེ་དག་ལ་རྟོག་པ་སྟེ།
en: One thinks those thoughts due to which the aggregates of discipline, samādhi, wisdom, liberation, and the vision of awareness of liberation rise up.

source: འདི་ནི་ཡང་དག་པའི་རྟོག་པ་ཞེས་བྱའོ།
en: This is called right thought

source: །དེ་ལ་ཡང་དག་པའི་ངག་གང་ཞེ་ན།
en: “Among these, what is right speech?

source: ངག་གང་གིས་བདག་དང་གཞན་ལ་གདུང་བར་མི་བྱེད་པ་དང་། བདག་དང་གཞན་ལ་ཉོན་མོངས་པར་མི་བྱེད་པ་དང་། བདག་དང་གཞན་ལ་གནོད་པར་མི་བྱེད་པ་དང་། ངག་གང་གིས་འཕགས་པ་རྣམས་ལ་ཡང་དག་པར་འཇུག་པའི་ངག་དེས་ཏིང་ངེ་འཛིན་ལ་དགའ་བར་སྦྱོར་བའི་ཚིག་དང་ལྡན་པ་ཡིན་ཏེ།
en: One is endowed with the speech through which one does not torment oneself or others, one does not afflict oneself or others, and one does not do wrong to oneself or others, the speech that is conducive to what the noble ones find fit, with expressions of samādhi and joy.

source: འདི་ནི་ཡང་དག་པའི་ངག་ཅེས་བྱའོ།
en: This is called right speech

source: །དེ་ལ་ཡང་དག་པའི་ལས་ཀྱི་མཐའ་གང་ཞེ་ན།
en: “Among these, what is right activity? One does not perform karma that is black and has black maturation.

source: ལས་གང་གནག་ལ་རྣམ་པར་སྨིན་པ་ཡང་གནག་པའི་ལས་དེ་མངོན་པར་འདུ་མི་བྱེད་པ་དང་། ལས་གང་དཀར་ལ་རྣམ་པར་སྨིན་པ་ཡང་དཀར་བའི་ལས་དེ་མངོན་པར་འདུ་བྱེད་པ་དང་། ལས་གང་དཀར་གནག་ཏུ་གྱུར་ལ་རྣམ་པར་སྨིན་པའང་དཀར་གནག་ཏུ་གྱུར་པའི་ལས་དེ་མངོན་པར་འདུ་མི་བྱེད་པ་དང་། ལས་གང་དཀར་པོ་མ་ཡིན་ལ་རྣམ་པར་སྨིན་པ་ནག་པོར་འགྱུར་བའི་ནག་པོ་ཟད་པར་འགྱུར་བའི་ལས་དེ་མངོན་པར་འདུ་བྱེད་པ་དང་། ལས་བཟང་པོ་ལ་རྟེན་པ་དང་། ལས་ཀྱི་མཐའ་བཟང་བ་སྟེ།
en: One performs karma that is white and has white maturation. One does not perform karma that occurs as white-black and occurs having white-black maturation. One performs karma that is conducive to the destruction of the black and what occurs having black, non-white maturation. One has good karma as refuge; one has good activity.

source: འདི་ནི་ཡང་དག་པའི་ལས་ཀྱི་མཐའ་ཞེས་བྱའོ།
en: This is called right activity

source: །དེ་ལ་ཡང་དག་པའི་འཚོ་བ་གང་ཞེ་ན།
en: “Among those, what is right livelihood?

source: གང་འཕགས་པའི་རིགས་སྦྱངས་པའི་ཡོན་ཏན་ཡོ་བྱད་བསྙུངས་པ་མི་འདོར་བ།
en: When, in accordance with the noble lineage, one does not abandon the good qualities of purification and does not abandon frugality;

source: ཚུལ་འཆོས་པ་མེད་པ་དང་། ཁ་གསག་མེད་པ་དང་། ཐོབ་ཀྱིས་འཇལ་བ་མེད་པ་དང་། དེས་པ་དང་། ཆོ་གའི་ངང་ཚུལ་ཅན་དང་། གཞན་གྱི་རྙེད་པ་ལ་ཕྲག་དོག་མེད་པ་དང་། བདག་གི་རྙེད་པས་ཆོག་པར་འཛིན་པ་དང་། འཕགས་པས་གནང་བ་ཁ་ན་མ་ཐོ་བ་མེད་པའི་འཚོ་བ་སྟེ།
en: when one does not engage in hypocrisy, chatter, or extortion; when one is in the habit of behaving heroically; when one has no envy at others’ gain and is content with one’s own gain;

source: འདི་ནི་ཡང་དག་པའི་འཚོ་བ་ཞེས་བྱའོ།
en: and when one has a blameless livelihood that is approved by the noble ones, this is called right livelihood

source: །དེ་ལ་ཡང་དག་པའི་རྩོལ་བ་གང་ཞེ་ན། རྩོལ་བ་གང་ལོག་པར་འགྱུར་བའི་ཕྱིར།
en: “Among those, what is right effort?

source: གང་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་རྒྱས་པར་འགྱུར་བའི་རྩོལ་བ་དེ་མི་འདོད་པ་དང་། རྩོལ་བ་གང་ཡང་དག་པའི་འཕགས་པའི་ལམ་གྱི་བདེན་པ་ལ་འཇུག་ཅིང་མྱ་ངན་ལས་འདས་པར་འགྲོ་བའི་ལམ་ལ་འཇོག་པའི་རྩོལ་བ་དེའི་རྗེས་སུ་འགྲོ་བ་སྟེ།
en: One does not endeavor in the effort that is wrong, due to which attraction, aversion, and confusion insidiously grow. One follows the effort that enters into the truth of the right path of the noble ones, the effort that bestows the path that leads to nirvāṇa.

source: །འདི་ནི་ཡང་དག་པའི་རྩོལ་བ་ཞེས་བྱའོ།
en: This is called right effort

source: །དེ་ལ་ཡང་དག་པའི་དྲན་པ་གང་ཞེ་ན།
en: “Among those, what is right mindfulness?

source: གང་དག་དེ་ལ་ཉེ་བར་གནས་ན་མི་གཡོ་བ་དང་། དྲན་པ་དང་། གྱ་གྱུ་མེད་པ་དང་། འཁོར་བའི་སྐྱོན་གྱི་ཉེས་དམིགས་ཡང་དག་པར་སྟོན་པ་དང་། མྱ་ངན་ལས་འདས་པའི་ལམ་དུ་འདྲེན་པའི་དྲན་པ་དང་། འཕགས་པའི་ལམ་མ་བརྗེད་པ་སྟེ།
en: It is well placed, unshakeable, upright, is not crooked, and rightly sees the flaws of saṃsāra as being misery; it is the mindfulness that guides on the path to nirvāṇa; and it means not to forget the path of the noble ones.

source: འདི་ནི་ཡང་དག་པའི་དྲན་པ་ཞེས་བྱའོ།
en: This is called right mindfulness

source: །དེ་ལ་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན།
en: “Among those, what is right samādhi?

source: གང་ཡང་དག་པ་ཉིད་དུ་མཉམ་པ་དང་། ཏིང་ངེ་འཛིན་གང་ལ་གནས་ནས་སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་ཐར་བར་བྱ་བའི་ཕྱིར་ཡང་དག་པར་བརྟན་པའི་ངེས་པར་གྱུར་པ་ལ་འཇུག་པ་སྟེ།
en: It is the samādhi that is even in the sense that it is right. It is the samādhi abiding in which one steps into the right certainty of steadfastness toward the liberation of all sentient beings.

source: འདི་ནི་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ།
en: This is called right samādhi

source: །དེ་ལ་དབུགས་རྔུབ་པ་དང་། འབྱུང་བ་དྲན་པ་རྣམ་པ་བཅུ་དྲུག་གང་ཞེ་ན།
en: “Now, what is mindfulness of inhalation and exhalation with sixteen aspects?

source: དྲན་བཞིན་དུ་དབུགས་བརྔུབས་ན་དྲན་བཞིན་དུ་དབུགས་བརྔུབས་སོ་སྙམ་དུ། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པ་དང་། དྲན་བཞིན་དུ་དབུགས་ཕྱུང་ན་དྲན་བཞིན་དུ་དབུགས་ཕྱུང་ངོ་སྙམ་དུ།
en: “Mindful as one breathes in, one is perfectly aware, as it is, that ‘Mindful, I am breathing in.’ Mindful as one breathes out, one is perfectly aware, as it is, that ‘Mindful, I am breathing out.’ . “Breathing in a long breath, one is perfectly aware, as it is, that ‘I am breathing in a long breath.’ Breathing out a long breath, one is perfectly aware, as it is, that ‘I am breathing out a long breath.’
